import Link from "next/link";

const GuestHome = () => {
  return (
    <>
      <div className="cluster">
        <Link href="/register">Создать свою ленту</Link>
        <Link href="/login">Войти</Link>
      </div>

      <section className="stack stack-md">
        <h2>Как это работает</h2>

        <section className="stack">
          <h3>1️⃣ Регистрируешься</h3>
          <p>Создай аккаунт за минуту — без лишних данных</p>
        </section>

        <section className="stack">
          <h3>2️⃣ Выбираешь города</h3>
          <p>Отметь города и категории новостей</p>
        </section>

        <section className="stack">
          <h3>3️⃣ Читаешь ленту</h3>
          <p>Получай актуальные новости в одном месте</p>
        </section>
      </section>

      <section className="stack stack-md">
        <h2>Почему это удобно</h2>

        <ul className="stack">
          <li>🧠 Никакого информационного шума</li>
          <li>🏙️ Только выбранные города</li>
          <li>📰 Только нужные категории</li>
          <li>🔒 Данные доступны только тебе</li>
        </ul>
      </section>
    </>
  );
};

export default GuestHome;
